zephyrproject-rtos/hal_nxp/dts/nxp/kinetis/ke1xz/pinctrl/MKE15Z128VLH7-pinctrl.h
/*
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MKE15Z128VLH7/signal_configuration.xml
 *
 * Copyright 2024, NXP
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on MKE17Z512VLH9-pinctrl.h with this part's differences applied
 * below (91 removed, 0 changed,
 * 85 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 0fc67e9e7f61f0e4
 */

#ifndef _ZEPHYR_DTS_BINDING_MKE15Z128VLH7_WRAPPER_
#define _ZEPHYR_DTS_BINDING_MKE15Z128VLH7_WRAPPER_

#include "MKE17Z512VLH9-pinctrl.h"

/* Signals not present on this part */
#undef ADC0_SE0_PTE9
#undef ADC0_SE10_PTC0
#undef ADC0_SE11_PTD6
#undef ADC0_SE12_PTC17
#undef ADC0_SE13_PTD7
#undef ADC0_SE15_PTC2
#undef ADC0_SE16_PTC15
#undef ADC0_SE17_PTC14
#undef ADC0_SE18_PTB3
#undef ADC0_SE19_PTB2
#undef ADC0_SE1_PTE8
#undef ADC0_SE20_PTB1
#undef ADC0_SE21_PTB0
#undef ADC0_SE22_PTC9
#undef ADC0_SE24_PTC8
#undef ADC0_SE2_PTD15
#undef ADC0_SE3_PTB5
#undef ADC0_SE4_PTD16
#undef ADC0_SE5_PTB4
#undef ADC0_SE6_PTE3
#undef ADC0_SE7_PTC3
#undef ADC0_SE8_PTC1
#undef ADC0_SE9_PTD5
#undef FXIO_D3_PTD5
#undef FXIO_D6_PTC2
#undef FXIO_D7_PTC3
#undef LPI2C0_SCL_PTD3
#undef LPI2C0_SDA_PTD2
#undef LPSPI0_PCS3_PTA7
#undef LPUART0_RX_PTA13
#undef LPUART0_RX_PTB6
#undef LPUART0_TX_PTA12
#undef LPUART0_TX_PTB7
#undef LPUART1_RX_PTC4
#undef LPUART1_TX_PTA4
#undef LPUART2_CTS_PTD5
#undef SCI0_RX_PTC0
#undef SCI0_RX_PTC14
#undef SCI0_TX_PTC1
#undef SCI0_TX_PTC15
#undef SCI1_RX_PTB12
#undef SCI1_RX_PTC16
#undef SCI1_TX_PTB13
#undef SCI1_TX_PTC17
#undef TSI0_CH0_PTE6
#undef TSI0_CH10_PTE10
#undef TSI0_CH11_PTD1
#undef TSI0_CH12_PTD0
#undef TSI0_CH16_PTE5
#undef TSI0_CH17_PTE4
#undef TSI0_CH18_PTE3
#undef TSI0_CH19_PTD16
#undef TSI0_CH1_PTE2
#undef TSI0_CH20_PTD15
#undef TSI0_CH21_PTE9
#undef TSI0_CH22_PTE8
#undef TSI0_CH23_PTB5
#undef TSI0_CH24_PTB4
#undef TSI0_CH2_PTA13
#undef TSI0_CH3_PTA12
#undef TSI0_CH4_PTA11
#undef TSI0_CH5_PTA10
#undef TSI0_CH6_PTE1
#undef TSI0_CH7_PTE0
#undef TSI0_CH8_PTC5
#undef TSI0_CH9_PTE11
#undef TSI1_CH0_PTC6
#undef TSI1_CH10_PTE7
#undef TSI1_CH11_PTA6
#undef TSI1_CH12_PTA7
#undef TSI1_CH13_PTC8
#undef TSI1_CH14_PTC9
#undef TSI1_CH15_PTB0
#undef TSI1_CH16_PTB1
#undef TSI1_CH17_PTB2
#undef TSI1_CH18_PTB3
#undef TSI1_CH19_PTC14
#undef TSI1_CH1_PTC7
#undef TSI1_CH20_PTC15
#undef TSI1_CH21_PTC16
#undef TSI1_CH22_PTC17
#undef TSI1_CH23_PTC0
#undef TSI1_CH24_PTC1
#undef TSI1_CH2_PTA0
#undef TSI1_CH3_PTA1
#undef TSI1_CH4_PTA2
#undef TSI1_CH5_PTA3
#undef TSI1_CH6_PTD2
#undef TSI1_CH7_PTD4
#undef TSI1_CH8_PTB12
#undef TSI1_CH9_PTB13

/* Signals specific to this part */
#define ACMP1_IN0_PTA6 KINETIS_MUX('A',6,0)
#define ACMP1_IN1_PTA7 KINETIS_MUX('A',7,0)
#define ACMP1_IN2_PTB4 KINETIS_MUX('B',4,0)
#define ACMP1_IN3_PTC1 KINETIS_MUX('C',1,0)
#define ACMP1_IN4_PTC0 KINETIS_MUX('C',0,0)
#define ACMP1_OUT_PTB5 KINETIS_MUX('B',5,7)
#define ADC0_SE0_PTA0 KINETIS_MUX('A',0,0)
#define ADC0_SE10_PTC2 KINETIS_MUX('C',2,0)
#define ADC0_SE11_PTC3 KINETIS_MUX('C',3,0)
#define ADC0_SE12_PTC14 KINETIS_MUX('C',14,0)
#define ADC0_SE13_PTC15 KINETIS_MUX('C',15,0)
#define ADC0_SE15_PTC17 KINETIS_MUX('C',17,0)
#define ADC0_SE1_PTA1 KINETIS_MUX('A',1,0)
#define ADC0_SE2_PTA6 KINETIS_MUX('A',6,0)
#define ADC0_SE3_PTA7 KINETIS_MUX('A',7,0)
#define ADC0_SE4_PTB0 KINETIS_MUX('B',0,0)
#define ADC0_SE5_PTB1 KINETIS_MUX('B',1,0)
#define ADC0_SE6_PTB2 KINETIS_MUX('B',2,0)
#define ADC0_SE7_PTB3 KINETIS_MUX('B',3,0)
#define ADC0_SE8_PTC0 KINETIS_MUX('C',0,0)
#define ADC0_SE9_PTC1 KINETIS_MUX('C',1,0)
#define ADC1_SE0_PTA2 KINETIS_MUX('A',2,0)
#define ADC1_SE10_PTE2 KINETIS_MUX('E',2,0)
#define ADC1_SE11_PTE6 KINETIS_MUX('E',6,0)
#define ADC1_SE1_PTA3 KINETIS_MUX('A',3,0)
#define ADC1_SE2_PTD2 KINETIS_MUX('D',2,0)
#define ADC1_SE3_PTD3 KINETIS_MUX('D',3,0)
#define ADC1_SE4_PTC6 KINETIS_MUX('C',6,0)
#define ADC1_SE5_PTC7 KINETIS_MUX('C',7,0)
#define ADC1_SE6_PTD4 KINETIS_MUX('D',4,0)
#define ADC1_SE7_PTB12 KINETIS_MUX('B',12,0)
#define ADC1_SE8_PTB13 KINETIS_MUX('B',13,0)
#define DAC0_OUT_PTE9 KINETIS_MUX('E',9,0)
#define EXTAL32_PTC3 KINETIS_MUX('C',3,0)
#define FTM0_FLT0/TRGMUX_IN6_PTE3_PTE3_PTE3_PTE3_PTE3_PTE3_PTE3_PTE3_PTE3 KINETIS_MUX('E',3,2)
#define FTM1_FLT2_PTC16 KINETIS_MUX('C',16,2)
#define FTM1_FLT2_PTE0 KINETIS_MUX('E',0,6)
#define FTM1_FLT3_PTC17 KINETIS_MUX('C',17,2)
#define FTM1_QD_PHA_PTA1 KINETIS_MUX('A',1,5)
#define FTM1_QD_PHA_PTB3 KINETIS_MUX('B',3,4)
#define FTM1_QD_PHB_PTB2 KINETIS_MUX('B',2,4)
#define FTM1_QD_PHB_PTC4 KINETIS_MUX('C',4,6)
#define FTM2_FLT2_PTD6 KINETIS_MUX('D',6,4)
#define FTM2_FLT3_PTD7 KINETIS_MUX('D',7,4)
#define FTM2_QD_PHA_PTA0 KINETIS_MUX('A',0,5)
#define FTM2_QD_PHA_PTE5 KINETIS_MUX('E',5,3)
#define FTM2_QD_PHB_PTC5 KINETIS_MUX('C',5,6)
#define FTM2_QD_PHB_PTE4 KINETIS_MUX('E',4,3)
#define RTC_CLKOUT_PTC4 KINETIS_MUX('C',4,3)
#define TRGMUX_IN4_PTD3_PTD3_PTD3_PTD3_PTD3_PTD3_PTD3_PTD3 KINETIS_MUX('D',3,6)
#define TRGMUX_IN5_PTD2_PTD2_PTD2_PTD2_PTD2_PTD2_PTD2_PTD2 KINETIS_MUX('D',2,6)
#define TRGMUX_IN6_PTE3_PTE3_PTE3_PTE3_PTE3_PTE3_PTE3_PTE3 KINETIS_MUX('E',3,6)
#define TRGMUX_IN7_PTD5_PTD5_PTD5_PTD5_PTD5_PTD5_PTD5_PTD5 KINETIS_MUX('D',5,6)
#define TRGMUX_OUT0_PTA1_PTA1_PTA1_PTA1_PTA1_PTA1_PTA1_PTA1 KINETIS_MUX('A',1,7)
#define TRGMUX_OUT1_PTD0_PTD0_PTD0_PTD0_PTD0_PTD0_PTD0_PTD0 KINETIS_MUX('D',0,7)
#define TRGMUX_OUT2_PTD1_PTD1_PTD1_PTD1_PTD1_PTD1_PTD1_PTD1 KINETIS_MUX('D',1,7)
#define TRGMUX_OUT3_PTA0_PTA0_PTA0_PTA0_PTA0_PTA0_PTA0_PTA0 KINETIS_MUX('A',0,7)
#define TRGMUX_OUT4_PTE10_PTE10_PTE10_PTE10_PTE10_PTE10_PTE10_PTE10 KINETIS_MUX('E',10,7)
#define TRGMUX_OUT5_PTE11_PTE11_PTE11_PTE11_PTE11_PTE11_PTE11_PTE11 KINETIS_MUX('E',11,7)
#define TSI0_CH0_PTE5 KINETIS_MUX('E',5,0)
#define TSI0_CH10_PTD7 KINETIS_MUX('D',7,0)
#define TSI0_CH11_PTE8 KINETIS_MUX('E',8,0)
#define TSI0_CH12_PTC5 KINETIS_MUX('C',5,0)
#define TSI0_CH13_PTE0 KINETIS_MUX('E',0,0)
#define TSI0_CH14_PTE1 KINETIS_MUX('E',1,0)
#define TSI0_CH15_PTC6 KINETIS_MUX('C',6,0)
#define TSI0_CH16_PTC7 KINETIS_MUX('C',7,0)
#define TSI0_CH17_PTA0 KINETIS_MUX('A',0,0)
#define TSI0_CH18_PTA1 KINETIS_MUX('A',1,0)
#define TSI0_CH19_PTE2 KINETIS_MUX('E',2,0)
#define TSI0_CH1_PTE4 KINETIS_MUX('E',4,0)
#define TSI0_CH20_PTB2 KINETIS_MUX('B',2,0)
#define TSI0_CH21_PTB3 KINETIS_MUX('B',3,0)
#define TSI0_CH22_PTC0 KINETIS_MUX('C',0,0)
#define TSI0_CH23_PTC1 KINETIS_MUX('C',1,0)
#define TSI0_CH24_PTE3 KINETIS_MUX('E',3,0)
#define TSI0_CH2_PTE10 KINETIS_MUX('E',10,0)
#define TSI0_CH3_PTE11 KINETIS_MUX('E',11,0)
#define TSI0_CH4_PTD0 KINETIS_MUX('D',0,0)
#define TSI0_CH5_PTD1 KINETIS_MUX('D',1,0)
#define TSI0_CH6_PTD5 KINETIS_MUX('D',5,0)
#define TSI0_CH7_PTD6 KINETIS_MUX('D',6,0)
#define TSI0_CH8_PTB4 KINETIS_MUX('B',4,0)
#define TSI0_CH9_PTB5 KINETIS_MUX('B',5,0)
#define XTAL32_PTC2 KINETIS_MUX('C',2,0)

#endif /* _ZEPHYR_DTS_BINDING_MKE15Z128VLH7_WRAPPER_ */
